tapeats/app/Models/Foods.php

select "foods".*, COALESCE(SUM(transaction_items.quantity), 0) as total_sold from "foods" left join "transaction_items" on "foods"."id" = "transaction_items"."foods_id" where "foods"."is_promo" = 1 group by "foods"."id"
---
    public function getPromo()
    {
        return DB::table('foods')
            ->leftJoin('transaction_items', 'foods.id', '=', 'transaction_items.foods_id')
            ->select('foods.*', DB::raw('COALESCE(SUM(transaction_items.quantity), 0) as total_sold'))
            ->where('foods.is_promo', 1)
            ->groupBy('foods.id')
            ->get();

select "foods".*, SUM(transaction_items.quantity) as total_sold from "transaction_items" inner join "foods" on "transaction_items"."foods_id" = "foods"."id" group by "foods"."id" order by "total_sold" desc
---
    public function getFavoriteFood()
    {
        return TransactionItems::select(
            'foods.*',
            DB::raw('SUM(transaction_items.quantity) as total_sold')
        )
            ->join('foods', 'transaction_items.foods_id', '=', 'foods.id')
            ->groupBy('foods.id')
            ->orderByDesc('total_sold')
            ->get();