tapeats/app/Livewire/Pages/HomePage.php

    public function mount(Foods $foods)
    {
        $this->categories = Category::all();
---
select * from "categories"